{
	"archanas-kitchen": [
		"The Onion Vada Sambar Recipe is a simple healthy and nutritious recipe of the urad dal vada that is pan fried in a paniyaram pan.  In this recipe, I have made the Vada’s healthy by using the Kuzhi Paniyaram pan as opposed to the traditional method of deep frying the vada's.",
		"Serve the delicious Onion Vada's with a Mixed Vegetable Sambar topped with finely chopped onions.",
		"To begin making the Onion Vada Sambar Recipe;  we will first soak the dal for about 3 hours.\n\nUsing a strainer, strain all the excess water from the urad dal. We need to use very little water to grind the urad dal, so that you can shape them well if you are deep frying.\n\nNext we will grind the dal, along with ginger and green chillies using a food processor or a mixer grinder into a very smooth batter. Make sure add very little water while grinding the dal to make a smooth batter. Transfer the batter to a bowl. \n\nAdd in the chopped onions, coriander leaves into the batter. Stir well to combine the ingredients well into the vada batter.\n\nNext we will preheat the Kuzhi Paniyaram Pan and add in a little oil into each cavity; once the pan is well heated spoon the mini onion vada mixture into each of the cavities. Cover the pan and allow it to steam until you notice that the top looks cooked. \n\nAfter a couple minutes of steaming of notice the top part of the mini onion vada looks cooked. At this point you could add a little more oil and then flip the vada so it can get cooked and crisp from both sides. This time, allow it to cook without the cover.\n\nTransfer the Mini Onion Vadas to a platter and continue the same process with the remaining batter.\n\nTo make the Vengaya Sambar recipe, pressure cook the toor dal along with 2 cups of water for 3 to 4 whistles and turn off the heat. Once the pressure releases naturally, open the cooking and mash the toor dal until soft. Keep aside.\n\nInto a pressure cooker; add the tamarind water, onions, radish, carrot, sambar powder and salt. Pressure cook for 2 whistles and turn off the heat.\n\nAdd the cooker toor dal into the sambar water and bring to a brisk boil. Adjust the consistency by adding a little water if required.\n\nIn a small tadka pan, heat oil over medium heat. Add mustard seeds and red chillies and allow it to crackle. Stir in the asafoetida and curry leaves. Pour this over the simmering vengaya sambar. Check the salt and spices of the vengaya sambar and adjust to suit your taste. Once done, turn off the heat , stir in the chopped coriander leaves and serve.\n\nTo serve the Onion Vada Sambar, place the vadas in a bowl or a platter, pour in some Vengaya Sambar and sprinkle some chopped onions and serve hot."
	],
	"bharatz-kitchen": [
		"I know that I haven’t been posting recipes lately and its been few long weeks but since work load have been too much lately I’m glad me and my team have now developed few awesome recipes like biryani’s and gol gappe and what not and I’m excited to videos soon so here is the first edition of the tale i.e Chicken Biryani Hyderabad Style I hope you like the recipe….",
		"INGREDIENTS TO MAKE THE BRINE:\n\n1 Liter Water\n\n30 Gms Salt or 1.5 Tbsp\n\n\n1 Tbsp Vineger",
		"INGREDIENTS TO MAKE THE RECIPE:\r\n\r\n \r\n\r\n400 Gms Chicken (cut into 16 pieces)\r\n\r\n*Whole Spice Mix\r\n\r\n1.5 tsp Red Chili Powder\r\n\r\n2 tsp Salt\r\n\r\n½ tsp Turmeric \/ Haldi Powder\r\n\r\n1.5 Tbsp Ginger Garlic Paste\r\n\r\n** Coriander and Mint Paste\r\n\r\n1 Tbsp lemon Juice\r\n\r\n2 Brown Onions\r\n\r\n1\/3 Cup Oil\r\n\r\n1\/3 Cup Curd\r\n\r\n*** Saffron and Milk Mix\r\n\r\n**** Ghee and Biryani Masala Mix\r\n\r\n½ Cup Bhaap (i.e. the water in which your rice is boiling)\r\n\r\n350 – 400  Gms Basmati Rice (or any long grain rice)\r\n\r\n \r\n\r\n \r\n\r\n*INGREDIENTS TO MAKE WHOLE SPICE MIX:\r\n\r\n \r\n\r\n2 Cinnamon Sticks or Daal Chini\r\n\r\n4 Black Peppercorns or Kali Mirch Sabut\r\n\r\n4 Kebab Chini or Cubeb (optional)\r\n\r\n4 Cloves or Laung\r\n\r\n¼ tsp Caraway Seeds or Shahi Jeera\r\n\r\n4 Green Cardamoms or Choti Elaichi\r\n\r\n \r\n\r\n**INGREDIENTS TO MAKE CORIANDER AND MINT PASTE:\r\n\r\n \r\n\r\n60 Gms Coriander leaves\r\n\r\n40 Gms Mint Leaves\r\n\r\n2 Green Chilies\r\n\r\n1-Inch Ginger\r\n\r\n5 Cloves Garlic\r\n\r\n1\/8 Cup Water\r\n\r\n \r\n\r\n***INGREDIENTS TO MAKE SAFFRON AND MILK MIX\r\n\r\n1\/4 Cup Warm Milk\r\n\r\nPinch or Saffron\r\n\r\n \r\n\r\n****INGREDIENTS TO MAKE GHEE AND BIRYANI MASALA MIX\r\n\r\n \r\n\r\n2 Tbsp Ghee\r\n\r\n2 tsp Biryani Masala (depending on how spicy you like )\r\n\r\n"
	],
	"zayka-ka-tadka": [
		"Moong Dal Idli | Instant Idli is a mouth-watering recipe that is full of proteins and you can have it as breakfast, lunch, or dinner. We prepare varieties of idli and for sure moong dal idli is not popular but when you will prepare this, you would love to have this healthy idli. It is a very nutritious dish made with moong dal which is rich in proteins and fibers. You can make this idli instantly when you are running out of idli batter. Try this recipe and share your experience.",
		"Ingredients\r\nYellow Moong Dal\/ Yellow Lentils – 1 cup\r\nFresh Curd\/Dahi – 2 tablespoon\r\nCarrot - 1\/2 no grated\r\nCoriander leaves – 1 teaspoon\r\nGinger-Green Chilli paste – 1 teaspoon\r\nGhee\/Oil – 2 tablespoon\r\nMustard seeds\/Rai - 1 teaspoon\r\nUrad dal\/Black Gram without skin – 1 teaspoon\r\nCurry leaves – 5\/6 leaves\r\nAsafoetida\/Hing – 1 pinch (optional)\r\nFruit Salt (ENO) - a pinch\r\nSalt – to taste",
		"Instructions\r\nWash and soak yellow lentils for two hours. Then strain out the water.\r\nNow, put the soaked yellow lentils in a mixer jar. Add curd, salt and very less amount of water to it and make a smooth paste. The batter should be of thick consistency.\r\nPlace the idli steamer on a medium flame. Add 1 glass of water in it and allow it to boil. Place the idli stand in the steamer.\r\nNow add ginger-green chilli paste, fresh coriander leaves, grated carrot and salt to taste to the batter. Mix well.\r\nTill then, heat up a tadka pan. Add 1 tablespoon of oil in it. Once the oil gets hot, add mustard seeds, black gram without skin, curry leaves and asafoetida.\r\nAdd the tempering to the batter. Grease the idli moulds with oil.\r\nNow add fruit salt (ENO) in the batter and mix till the batter become frothy.\r\nPour the batter in the idli moulds and then place the moulds in the idli steamer. Cover the lid and steam for 10-15 minutes on a medium flame.\r\nAfter 10-15 minutes, turn off the flame and check one of the idlis with a knife. If the knife comes out without sticking, the idli is ready.\r\nAllow it to cool for 15 minutes. Grease knife with a little oil and then remove the idlis from the moulds.\r\nServe yummy idlis with ketchup, green chutney, or coconut chutney.\r\nServings : 2\r\nReady in : 140 minutes\r\nSpecial Category : Healthy Food\r\nRecipe Type : Breakfast, Dinner, Lunch"
	]
}